# PointCloudFilterFactory Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudFilterFactory Class
Members See Also
---
A factory class for creating point cloud filters.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class PointCloudFilterFactory
```

Visual Basic
---
```text
Public NotInheritable Class PointCloudFilterFactory
```

Visual C++
---
```text
public ref class PointCloudFilterFactory abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.PointClouds..::..PointCloudFilterFactory
# See Also
PointCloudFilterFactory Members
Autodesk.Revit.DB.PointClouds Namespace